# SQL Subqueries - Lab Assignment #2

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database ERD

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="img/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database `data2.sqlite` in the data folder.

In [2]:
# Your code here; import the necessary packages
import sqlite3
import pandas as pd
import

In [25]:
# Your code here; create the connection
conn = sqlite3.Connection("data/data2.sqlite")

## Write an Equivalent Query using a Subquery

The following query works using a `JOIN`. Rewrite it so that it uses a subquery instead.

``'SELECT
    customerNumber,
    contactLastName,
    contactFirstName
FROM customers
JOIN orders 
    USING(customerNumber)
WHERE orderDate = '2003-01-31'
;
```

In [32]:
w1 = """
SELECT orders.customerNumber, customers.contactLastName, customers.contactFirstName
FROM customers, orders
WHERE orders.orderDate = customers.customerNumber'2003-01-31'
(SELECT orderDate
FROM orders
WHERE orderDate = '2003-01-31')
;
"""
w1 = pd.read_sql(w1, conn)

DatabaseError: Execution failed on sql '
SELECT orders.customerNumber, customers.contactLastName, customers.contactFirstName
FROM customers, orders
WHERE orders.orderDate = customers.customerNumber'2003-01-31'
(SELECT orderDate
FROM orders
WHERE orderDate = '2003-01-31')
;
': near "'2003-01-31'": syntax error

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [34]:
# Your code here
q2 = """ 
SELECT customers.customerName, customers.customerNumber, products.productName, orderdetails.productCode, orderdetails.quantityOrdered AS total_ordered
FROM customers
INNER JOIN orderdetails
ON orderdetails.orderNumber = orders.orderNumber
INNER JOIN orders
ON customers.customerNumber = orders.customerNumber
INNER JOIN products
ON products.productCode = orderdetails.productCode
GROUP BY customers.customerNumber
HAVING total_ordered >= 10
ORDER BY total_ordered DESC
;
"""
q2_result = pd.read_sql(q2, conn)
q2_result

,customerName,customerNumber,productName,productCode,total_ordered
0,Signal Collectibles Ltd.,487,1937 Lincoln Berline,S18_1342,50
1,Online Mini Collectables,204,1968 Ford Mustang,S12_1099,50
2,Danish Wholesale Imports,145,1972 Alfa Romeo GTA,S10_4757,50
3,Corporate Gift Ideas Co.,321,1969 Harley Davidson Ultimate Chopper,S10_1678,49
4,Mini Creations Ltd.,320,1972 Alfa Romeo GTA,S10_4757,49
...,...,...,...,...,...
93,Suominen Souveniers,334,1957 Chevy Pickup,S12_4473,21
94,"Toms Spezialitäten, Ltd",259,1968 Ford Mustang,S12_1099,21
95,Mini Caravy,209,1965 Aston Martin DB5,S18_1589,21
96,Mini Gifts Distributors Ltd.,124,1958 Setra Bus,S12_1666,21
97,Signal Gift Stores,112,1917 Grand Touring Sedan,S18_1749,21

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

### A quick note on the SQL  `SELECT DISTINCT` statement:

The `SELECT DISTINCT` statement is used to return only distinct values in the specified column. In other words, it removes the duplicate values in the column from the result set.

Inside a table, a column often contains many duplicate values; and sometimes you only want to list the unique values. If you apply the `DISTINCT` clause to a column that has `NULL`, the `DISTINCT` clause will keep only one NULL and eliminates the other. In other words, the DISTINCT clause treats all `NULL` “values” as the same value.

In [ ]:
# Your code here
# Hint: because one of the tables we'll be joining has duplicate customer numbers, you should use DISTINCT



#WITH top_3_airports AS (
 #   SELECT 
       # airports.id 
  #     airports 
   #     LEFT JOIN routes
    #        ON routes.source_id = airports.id
    #GROUP BY
   #     airports.id
    #ORDER BY 
        #COUNT() DESC
    #LIMIT 3
#3) 

#SELECT DISTINCT
    #rt.airline
#FROM
   # routes AS rt
    #LEFT JOIN airports AS ap
       # ON rt.source_id = ap.id
#WHERE 
    #rt.source_id IN top_3_airports

## Select the Employee Number, First Name, Last Name, City (of the office), and Office Code of the Employees Who Sold Products That Have Been Ordered by Fewer Than 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [ ]:
# Your code here

## Select the Employee Number, First Name, Last Name, and Number of Customers for Employees Whose Customers Have an Average Credit Limit Over 15K

In [ ]:
# Your code here

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!